//【今日题目】：
//请输出所有的"水仙花数"。
//所谓"水仙花数"是指一个3位数, 
//其各位数字立方和等于该数本身。
//例如, 153是水仙花数, 因为153 = 1*1*1 + 5*5*5 + 3*3*3"

#include <stdio.h>
#include <math.h>

//int main()
//{
//	//循环遍历所有的三位数
//	int i = 0;
//	for (i = 100;i<1000;i++)
//	{
//		//定义三个变量,接收分离后的值
//		int a = 0;
//		int b = 0;
//		int c = 0;
//		//三位数分离
//		a = i / 100;//得到百位
//		b = i / 10 % 10;//得到十位
//		c = i % 10;//得到个位
//		int sum = a * a * a + b * b * b + c * c * c;
//
//		//使用if判断，分离后每个值的三次方相加，
//		//是否等于原本的这个三位数
//		if (i == sum )
//		{
//			printf("%d\n", sum);//打印输出
//		}
//	}
//	return 0;
//}

// 方法二：
int  main()
{
	int a = 0;
	int b = 0;
	int c = 0;
	printf("打印水仙花数：");
	for (a = 1; a <= 9; a++)//百位的循环遍历
	{
		for (b = 0; b <= 9; b++)//十位的循环遍历
		{
			for (c = 0; c <= 9; c++)//个位的循环遍历
			{
				int num = a * 100 + b * 10 + c;//得到所有的三位数
				int sum = pow(a, 3) + pow(b, 3) + pow(c, 3);//遍历的数的三次方之和
				if (num == sum)//判断是否等于该数本身
				{
					printf("%4d", num);//输出
				}
			}
		}
	}
	printf("\n");
	return 0;
}